tap "nikitabobko/tap"
tap "romkatv/powerlevel10k"

# Powerlevel10k prompt theme (sourced from shell/.zshrc)
brew "powerlevel10k"

# CLI essentials
brew "tmux"
brew "ripgrep"
brew "fd"
brew "bat"
brew "fzf"
brew "gh"
brew "git-delta"
brew "jq"
brew "tree"
brew "wget"

# Window management & automation
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"
cask "hammerspoon"
cask "raycast"

# Terminal & editor
cask "iterm2"
cask "claude-code"
